# Icelandic Identity Codes

## Introduction

The function `clean_is_kennitala()` cleans a column containing Icelandic identity code (Kennitala) strings, and standardizes them in a given format. The function `validate_is_kennitala()` validates either a single Kennitala strings, a column of Kennitala strings or a DataFrame of Kennitala strings, returning `True` if the value is valid, and `False` otherwise.

Kennitala strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "1201743399"
* `standard`: Kennitala strings with proper whitespace in the proper places, like "120174-3399"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_is_kennitala()` and `validate_is_kennitala()`.

### An example dataset containing Kennitala strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "kennitala": [
            "1201743399",
            "320174-3399",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

        kennitala                                           address
0      1201743399                                     123 Pine Ave.
1     320174-3399                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_is_kennitala`

By default, `clean_is_kennitala` will clean kennitala strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_is_kennitala
clean_is_kennitala(df, column = "kennitala")

,kennitala,address,kennitala_clean
0,1201743399,123 Pine Ave.,120174-3399
1,320174-3399,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_is_kennitala(df, column = "kennitala", output_format="standard")

,kennitala,address,kennitala_clean
0,1201743399,123 Pine Ave.,120174-3399
1,320174-3399,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_is_kennitala(df, column = "kennitala", output_format="compact")

,kennitala,address,kennitala_clean
0,1201743399,123 Pine Ave.,1201743399
1,320174-3399,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned Kennitala strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_is_kennitala(df, column="kennitala", inplace=True)

  kennitala_clean                                           address
0     120174-3399                                     123 Pine Ave.
1             NaN                                           main st
2             NaN                      1234 west main heights 57033
3             NaN                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_is_kennitala(df, "kennitala", errors="coerce")

,kennitala,address,kennitala_clean
0,1201743399,123 Pine Ave.,120174-3399
1,320174-3399,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_is_kennitala(df, "kennitala", errors="ignore")

,kennitala,address,kennitala_clean
0,1201743399,123 Pine Ave.,120174-3399
1,320174-3399,main st,320174-3399
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_is_kennitala()`

`validate_is_kennitala()` returns `True` when the input is a valid Kennitala. Otherwise it returns `False`.

The input of `validate_is_kennitala()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_is_kennitala()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_is_kennitala()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_is_kennitala
print(validate_is_kennitala("1201743399"))
print(validate_is_kennitala("320174-3399"))
print(validate_is_kennitala("51824753556"))
print(validate_is_kennitala("51 824 753 556"))
print(validate_is_kennitala("hello"))
print(validate_is_kennitala(np.nan))
print(validate_is_kennitala("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_is_kennitala(df["kennitala"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: kennitala, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_is_kennitala(df, column="kennitala")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: kennitala, dtype: bool

### Only DataFrame

In [11]:
validate_is_kennitala(df)

   kennitala  address
0       True    False
1      False    False
2      False    False
3      False    False
4      False    False
5      False    False
6      False    False